<center>
    
# äººå·¥æ™ºèƒ½é«˜é˜¶äººæ‰åŸ¹è®­ç­
## è¯¾ç¨‹ä½œä¸šï¼ˆäºŒï¼‰

---

> ğŸ’¥è¯´æ˜ğŸ’¥
> 1. æœ¬æ¬¡ä½œä¸šæœ€æ™šæäº¤æ—¶é—´ï¼š **<font color='red'>2019å¹´6æœˆ12æ—¥</font>**
> 2. ä½œä¸šä¸­ä»¥`Q-n`æ ‡æ³¨çš„å‡ ä¸ªé—®é¢˜çš„ç­”æ¡ˆè¯·é€šè¿‡[ç­”é¢˜é¡µé¢](https://app.askform.cn/43245470-5adc-4293-9427-0a33e9743625.aspx?Type=2)è¿æ¥çš„Formè¡¨æ ¼æäº¤ï¼Œæäº¤ä¸­å¡«å†™çš„å§“åè¯·ä¸æœ¬äººå§“åä¿æŒä¸€è‡´ï¼›
> 3. ä»¥`Lesson02-HW-{ä½ çš„åå­—è‹±æ–‡}.ipynb`å‘½åçš„ä½œä¸šæ–‡ä»¶è¯·å‚è€ƒ[æ–‡æ¡£](../How-To.md)è¯´æ˜æäº¤åˆ°Gitçš„ä»£ç ä»“åº“ï¼›
> 4. å¦‚æœå®Œæˆä½œä¸šè¿‡ç¨‹ä¸­ï¼Œä½ æœ‰ä»»ä½•æ–°çš„æƒ³æ³•å’Œè§£é¢˜æ€è·¯ï¼Œå¯ä»¥å®Œæˆä¸€ç¯‡åˆ†äº«æ–‡æ¡£(å»ºè®®ç”¨MarkDownæ’°å†™)ï¼Œå°†æ ¹æ®è´¨é‡ç»™äºˆâ­å¥–åŠ±
> 5. ğŸš« **æ³¨æ„ï¼š** è¯·ä¸è¦ç›´æ¥ç¼–è¾‘è¯¥æ¨¡æ¿æ–‡ä»¶ï¼Œå»ºè®®å¤åˆ¶è¯¥æ¨¡æ¿æ–‡ä»¶ç”Ÿæˆæ–°çš„ä»¥ä½ è‡ªå·±å§“åå‘½åçš„ä½œä¸šæ–‡ä»¶ï¼ˆ`Lesson02-HW-{ä½ çš„åå­—ä¸­æ–‡}.ipynb`ï¼‰

### Q1
å‚è€ƒè¯¾ç¨‹ä¸­ä½¿ç”¨`numpy`è¿›è¡Œæ•°ç†ç»Ÿè®¡çš„è¿‡ç¨‹ï¼Œä½¿ç”¨numpyæä¾›çš„åº“`random.normal`ç”Ÿæˆ1ä¸‡ä¸ªæ ·æœ¬

æœ¬é¢˜ç›®ä¸­ä½¿ç”¨ä¸‹è¡¨æ ¼ä¸­**åä¸­åœ°åŒºçš„å¥³æ€§èº«é«˜æ•°æ®**ä½œä¸ºå‚è€ƒæº

<center>

##### ä¸­å›½æˆå¹´äººèº«é«˜ï¼Œä½“é‡å‡å€¼å’Œæ ‡å‡†å·®çš„å‚è€ƒå€¼ ï¼ˆ2015ï¼‰
|æ€§åˆ«|ä¸œåŒ—ååŒ—|è¥¿åŒ—|ä¸œå—|åä¸­|åå—|è¥¿å—|
|-|-|-|-|-|-|-|
|èº«é«˜ï¼Œä½“é‡|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|å‡å€¼ï¼Œæ ‡å‡†å·®|
|ç”·(mm)|1693, 56.6|1684, 53.7|1686, 55,2|1669, 56.3|1650, 57.1|1647, 56.7|
|å¥³(mm)|1586, 51.8|1575, 51.9|1575, 50.8|1560, 50.7|1549, 49.7|1546, 53.9|
|ç”·(kg)|64, 8.2|60, 7.6|59, 7.7|57, 6.9|56, 6.9|55, 6.8|
|å¥³(kg)|55, 7.1|52, 7.1|51, 7.2|50, 6.8|49, 6.5|50, 6.9|


> **æ³¨æ„ï¼š**ä¸ºä¿è¯ç»“æœçš„ä¸€è‡´æ€§ï¼Œè¯·æ¯æ¬¡åœ¨ä½ æ‰§è¡Œéšæœºåˆ†å¸ƒç”Ÿæˆä¹‹å‰ï¼Œä½¿ç”¨`np.random.seed(42)`ï¼Œäº§ç”ŸåŒæ ·çš„ç§å­å€¼

#### é—®ï¼š ä½ ç”Ÿæˆçš„åˆ†å¸ƒçš„å®é™…äº§ç”Ÿçš„æ–¹å·®ã€å‡å€¼ã€ä¸­ä½æ•°å„æ˜¯å¤šå°‘(ä¿ç•™ä¸¤ä½å°æ•°)ï¼Ÿ
- 50.70, 1560.01, 1575.91
- 50.87, 1560, 1560.69
- 2588.06, 1599.89, 1599.87
- 50.87, 1599.89, 1599.87

In [50]:
import numpy as np
np.random.seed(42)
# your code

female = np.random.normal(1560, 50.7,10000)

print("æ–¹å·®: " + str(round(np.var(female),2)))
print("å‡å€¼: " + str(round(np.mean(female),2)))
print("ä¸­ä½æ•°: " + str(round(np.median(female),2)))
print(female)

æ–¹å·®: 2588.06
å‡å€¼: 1559.89
ä¸­ä½æ•°: 1559.87
[1585.18340756 1552.98999993 1592.83780888 ... 1524.2404421  1585.13531455
 1592.67049459]

## Q2-Q9
Q2-Q9å°†ä½¿ç”¨kaggleå…¥é—¨ä¸­å¸¸ä½¿ç”¨çš„æ³°å¦å°¼å…‹æ•°æ®é›†ï¼Œè¯¦æƒ…å¯ä»¥è®¿é—®[Titanic: Machine Learning from Disaster](https://www.kaggle.com/c/titanic)ï¼Œä¸ºäº†æ–¹ä¾¿å¤„ç†æˆ‘ä»¬å·²ç»å¯¹åŸå§‹æ•°æ®è¿›è¡Œäº†åˆæ­¥çš„å¤„ç†ï¼ˆå¦‚ç¼ºå¤±å€¼ã€å¼‚å¸¸å€¼ç­‰ï¼‰ã€‚

åœ¨è¿™ä¸€ç³»åˆ—é¢˜ç›®ä¸­ï¼Œæˆ‘ä»¬å°†ç»¼åˆä½¿ç”¨`numpy`, `pandas`å’Œ`matplotlib`è§£å†³ä¸€ä¸ªæ³°å¦å°¼å…‹å·æ•°æ®çš„åˆæ­¥åˆ†æé—®é¢˜ã€‚åœ¨æœºå™¨å­¦ä¹ ä¸­ï¼Œé€šè¿‡å¤šç§ä¸åŒçš„æ–¹å¼å¯¹æ•°æ®è¿›è¡Œåˆ†ææœ‰åŠ©äºåŠæ—¶æ•è·æ•°æ®ç‰¹å¾å’Œæ•°æ®ä¹‹é—´çš„å…³è”ã€‚

In [20]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

é¦–å…ˆæˆ‘ä»¬ä½¿ç”¨pandaså¯¼å…¥æ•°æ®

In [25]:
data = pd.read_csv('../data/titanic_train.csv',
                  index_col='PassengerId')

æŸ¥çœ‹æ•°æ®ç»“æ„å’ŒåŸºæœ¬ç»„æˆ

In [26]:
data.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

æ¯ä¸ªå­—æ®µçš„å«ä¹‰å¦‚ä¸‹ï¼š

| **Variable** | **Definition**                             | **Key**                                        |
| ------------ | ------------------------------------------ | ---------------------------------------------- |
| survival     | Survival                                   | 0 = No, 1 = Yes                                |
| pclass       | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                      |
| sex          | Sex                                        |                                                |
| Age          | Age in years                               |                                                |
| sibsp        | # of siblings / spouses aboard the Titanic |                                                |
| parch        | # of parents / children aboard the Titanic |                                                |
| ticket       | Ticket number                              |                                                |
| fare         | Passenger fare                             |                                                |
| cabin        | Cabin number                               |                                                |
| embarked     | Port of Embarkation                        | C = Cherbourg, Q = Queenstown, S = Southampton |

In [23]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

ä¸ºäº†è®©å¤§å®¶å¿«é€Ÿç†Ÿæ‚‰pandasï¼Œæˆ‘ä»¬å‡†å¤‡äº†å‡ ä¸ªç®€å•çš„æ“ä½œï¼š

1. è®©æˆ‘ä»¬å°è¯•ä»ä¹˜å®¢ä¸­è¿‡æ»¤åªæ˜¾ç¤ºé€šè¿‡Cherbourg(Embarked=C) ç™»é™†å¹¶ä¸”ä»˜è´¹å¤§äº200ç£…ï¼ˆfare > 200ï¼‰ï¼š

In [16]:
data[(data['Embarked'] == 'C') & (data.Fare > 200)].head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C,1.0
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C,2.0
300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,2.0
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,1.0
378,0,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.5000,C82,C,1.0

2. æˆ‘ä»¬å¯ä»¥ä½¿ç”¨`sort_values`é™åºæ’åˆ—è¿™äº›æ•°æ®ï¼Œæ’åºå…³é”®å­—é€šè¿‡`by`å­—æ®µå®šä¹‰

In [9]:
data[(data['Embarked'] == 'C') & 
     (data['Fare'] > 200)].sort_values(by='Fare',
                               ascending=False).head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
312,1,1,"Ryerson, Miss. Emily Borie",female,18.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
743,1,1,"Ryerson, Miss. Susan Parker ""Suzette""",female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C

3. æˆ‘ä»¬æ¥å°è¯•åœ¨æ•°æ®ä¸­æ·»åŠ ä¸€ä¸ªæ–°çš„ç‰¹å¾ï¼ˆä¸€ä¸ªæ–°çš„columnï¼‰

In [5]:
def age_category(age):
    '''
    < 30 -> 1
    >= 30, <55 -> 2
    >= 55 -> 3
    '''
    if age < 30:
        return 1
    elif age < 55:
        return 2
    elif age >= 55:
        return 3

In [6]:
age_categories = [age_category(age) for age in data.Age]
data['Age_category'] = age_categories

å¦ä¸€ç§å®ç°æ–¹æ³•æ˜¯é€šè¿‡`.apply`å‡½æ•°å®ç°
```python
data['Age_category'] = data['Age'].apply(age_category)
```

ä½ å¯ä»¥é€šè¿‡`data.head()`å‘½ä»¤æŸ¥çœ‹æ–°çš„æ•°æ®çš„æƒ…å†µ

In [7]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_category
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2.0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2.0
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2.0

### **Q2. èˆ¹ä¸Šæœ‰å¤šå°‘ç”·æ€§å’Œå¥³æ€§ï¼Ÿ**
- 412 ç”·æ€§ 479 å¥³æ€§
- 314 ç”·æ€§ 577 å¥³æ€§
- 479 ç”·æ€§ 412 å¥³æ€§
- 577 ç”·æ€§ 314 å¥³æ€§

In [31]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#
data.groupby(by=['Sex']).count()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,
female,314,314,314,261,314,314,314,314,97,312
male,577,577,577,453,577,577,577,577,107,577

### **Q3. å½“æ—¶èˆ¹ä¸Šæœ‰å¤šå°‘ç”·æ€§æŒæœ‰äºŒçº§èˆ¹ç¥¨ï¼ˆPclass=2ï¼‰ï¼Ÿ**
- 104
- 108
- 112
- 125

In [35]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#
data[(data["Pclass"]==2) & (data["Sex"]=="male")][["Ticket"]].count()

Ticket    108
dtype: int64

### **Q4. æ‰€æœ‰ä¹˜å®¢Fareçš„ä¸­ä½æ•°å’Œæ ‡å‡†å·®æ˜¯å¤šå°‘ï¼Ÿï¼ˆä¿ç•™ä¸¤ä½å°æ•°ï¼‰**
- ä¸­ä½æ•°ä¸º 14.45, æ ‡å‡†å·®ä¸º 49.69
- ä¸­ä½æ•°ä¸º 15.1, æ ‡å‡†å·®ä¸º 12.15
- ä¸­ä½æ•°ä¸º 13.15, æ ‡å‡†å·®ä¸º 35.3
- ä¸­ä½æ•°ä¸º  17.43, æ ‡å‡†å·®ä¸º 39.1

In [40]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#

print("æ‰€æœ‰ä¹˜å®¢Fareçš„ä¸­ä½æ•°: " + str(data[['Fare']].median()))
print("æ‰€æœ‰ä¹˜å®¢Fareçš„æ ‡å‡†å·®: " + str(data[['Fare']].std()))

æ‰€æœ‰ä¹˜å®¢Fareçš„ä¸­ä½æ•°: Fare    14.4542
dtype: float64
æ‰€æœ‰ä¹˜å®¢Fareçš„æ ‡å‡†å·®: Fare    49.693429
dtype: float64

### **Q5. å¹¸å­˜è€…çš„å¹³å‡å¹´é¾„æ˜¯å¦é«˜äºæœ€ç»ˆæ­»äº¡çš„ä¹˜å®¢?**
- Yes
- No

> Tips: å¯ä»¥å‚è€ƒpandasçš„`groupby`å‘½ä»¤

In [142]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#
print("ç”Ÿå­˜è€…å¹³å‡å¹´é¾„" + str(data[data['Survived']==1][['Age']].mean()))
print("æ­»äº¡è€…å¹³å‡å¹´é¾„" + str(data[data['Survived']==0][['Age']].mean()))
print(round(data[['Survived','Age']].groupby(by=['Survived']).mean(),2))

ç”Ÿå­˜è€…å¹³å‡å¹´é¾„Age    28.34369
dtype: float64
æ­»äº¡è€…å¹³å‡å¹´é¾„Age    30.626179
dtype: float64
            Age
Survived
0         30.63
1         28.34

### **Q6.å¹´é¾„å°äº30å²çš„ä¹˜å®¢æ˜¯å¦æ¯”å¹´é¾„å¤§äº60å²çš„ä¹˜å®¢æœ‰æ›´å¤§çš„å­˜æ´»æ¦‚ç‡ï¼Ÿ å­˜æ´»æ¦‚ç‡å„ä¸ºå¤šå°‘ï¼Ÿ**
- å¹´è½»äººä¸º22.7%ï¼Œå¹´é•¿è€…ä¸º40.6% 
- å¹´è½»äººä¸º40.6%ï¼Œ å¹´é•¿è€…ä¸º22.7%
- å¹´è½»äººä¸º35.3%ï¼Œå¹´é•¿è€…ä¸º27.4%
- å¹´è½»äººä¸º27.4%ï¼Œå¹´é•¿è€…ä¸º35.3%

> Tips: å¯ä»¥æŸ¥çœ‹ pandas.crosstab()å‡½æ•°çš„ç”¨æ³•

In [68]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#

data['class'] = data.apply(lambda x: "old" if x['Age']>60 else "young" if x['Age']<30 else "normal" , axis=1)
print(str(round(data.groupby(by='class').sum().Survived/data.groupby(by='class').count().Survived*100,2)) + "%")

class
normal    37.32
old       22.73
young     40.62
Name: Survived, dtype: float64%

### **Q7. å¥³æ€§æ˜¯å¦æ¯”ç”·æ€§æœ‰æ›´å¤§çš„å­˜æ´»æ¦‚ç‡? ç”·æ€§ä¸å¥³æ€§å­˜æ´»äººæ•°å„å æ‰€åœ¨æ€§åˆ«çš„ç™¾åˆ†ä¹‹å¤šå°‘ï¼Ÿ**
- ç”·æ€§ä¸º30.2%, å¥³æ€§ä¸º46.2%
- ç”·æ€§ä¸º35.7%, å¥³æ€§ä¸º74.2%
- ç”·æ€§ä¸º21.1%, å¥³æ€§ä¸º46.2%
- ç”·æ€§ä¸º18.9%, å¥³æ€§ä¸º74.2%

In [69]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#
print(str(round(data.groupby(by='Sex').sum().Survived/data.groupby(by='Sex').count().Survived*100,2)) + "%")

Sex
female    74.20
male      18.89
Name: Survived, dtype: float64%

### **Q8. ç”·æ€§ä¹˜å®¢ä¸­æœ€å—æ¬¢è¿çš„åå­—æ˜¯ä»€ä¹ˆï¼Ÿ**
- Charles
- Thomas
- William
- John

> Tipsï¼š è¯·å¯¹ç…§ç»™å‡ºçš„å‡ ä¸ªé€‰é¡¹äº†è§£åå­—å‡ºç°çš„ä½ç½®

In [125]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#

data['Given_name'] = data.apply(lambda x: x.Name.split(" ")[2] , axis=1)

data[data['Sex']=="male"].groupby(by=["Given_name"]).count().sort_values(by=['Survived'],ascending=False).head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,class
Given_name,,,,,,,,,,,,
William,35,35,35,35,31,35,35,35,35,9,35,35
John,25,25,25,25,19,25,25,25,25,5,25,25
George,14,14,14,14,11,14,14,14,14,4,14,14
Charles,13,13,13,13,10,13,13,13,13,2,13,13
Thomas,13,13,13,13,7,13,13,13,13,3,13,13

### **Q9. ç”·æ€§/å¥³æ€§çš„å¹³å‡å¹´é¾„ä¸`Pclass`çš„å…³ç³»ï¼Œå¦‚ä¸‹å£°æ˜æ­£ç¡®çš„æ˜¯(å¤šé€‰)ï¼š**
- å¹³å‡è€Œè¨€ï¼Œä¸€çº§ä»“ä¸­çš„ç”·æ€§å¹´é¾„å¹³å‡è¶…è¿‡40å²
- ä¸€çº§ä»“ä¸­å¥³æ€§çš„å¹³å‡å¹´é¾„è¶…è¿‡40å²
- æ‰€æœ‰ä¸åŒçº§åˆ«ä»“ä¸­ç”·æ€§çš„å¹³å‡å¹´é¾„éƒ½å¤§äºåŒä¸€çº§ä»“ä¸­çš„å¥³æ€§
- å¹³å‡è€Œè¨€ï¼Œä¸€çº§ä»“ä¹˜å®¢å¹´é¾„å¤§äºäºŒçº§ç¥¨ä»“ï¼ŒäºŒçº§ä»“å¤§äºä¸‰çº§ç¥¨ä»“

In [141]:
# åœ¨æ­¤ç¼–å†™ä»£ç å›ç­”é—®é¢˜
#

print("ä¸€çº§ä»“ä¸­çš„ç”·æ€§å¹´é¾„å¹³å‡: " + str(round(data[(data["Pclass"]==1) & (data['Sex']=="male")].Age.mean(),2)))
print("ä¸€çº§ä»“ä¸­çš„å¥³æ€§å¹´é¾„å¹³å‡: " + str(round(data[(data["Pclass"]==1) & (data['Sex']=="female")].Age.mean(),2)))
print(round(data[["Pclass","Sex","Age"]].groupby(by=["Pclass","Sex"]).mean(),2))
print(round(data[["Pclass","Age"]].groupby(by=["Pclass"]).mean(),2))

ä¸€çº§ä»“ä¸­çš„ç”·æ€§å¹´é¾„å¹³å‡: 41.28
ä¸€çº§ä»“ä¸­çš„å¥³æ€§å¹´é¾„å¹³å‡: 34.61
                 Age
Pclass Sex
1      female  34.61
       male    41.28
2      female  28.72
       male    30.74
3      female  21.75
       male    26.51
          Age
Pclass
1       38.23
2       29.88
3       25.14